case/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include         "include/freestreamConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField uniform $U;

boundaryField
{
    "wing.*"
    {
        type            boundaryCorrectedFixedValue;
        value           uniform (0 0 0);
    }
    symmetry1
    {
        type            symmetry;
    }
    symmetry2
    {
        type            symmetry;
    }
    inout
    {
        type            characteristicFarfieldVelocity;
        #include        "include/freestreamConditions"
        value           uniform (0 0 0);
        //type            inletOutlet;
        //inletValue      $internalField;
        //value           $internalField;
    }
}


// ************************************************************************* //
