case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    symmetry1
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          57522;
        startFace       114451;
    }
    symmetry2
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          57522;
        startFace       171973;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          427;
        startFace       229495;
    }
    inout
    {
        type            patch;
        nFaces          759;
        startFace       229922;
    }
)

// ************************************************************************* //
